;(function() {
	'use strict'

	const articles = [
			{
			id: 1,
			title: 'Самые агрессивные породы собак',
			content: `
# Самые агрессивные породы собак

Собаки, как и люди, имеют разные характеры, темпераменты, склонности и любимые занятия. От воспитания и заложенных природой особенностей зависит поведение животного. Даже самые агрессивные породы собак при должной дрессуре будут ласковыми друзьями.

## Питбуль
![Питбуль][1]
[Питбули][2] приобрели печальную известность. Многие считают, что это самые агрессивные собаки в мире. Питбулей достаточно долго использовали на собачьих боях, что привело к созданию имиджа злого, неконтролируемого и кровожадного животного. Дошло до того, что представителей породы запретили в нескольких странах.

>Внимание! Из-за неправильного воспитания нередки летальные исходы при стычке человека 
>и питбуля. Если животное привыкло к жестокости и необходимости сражаться, оно не 
>отступит, пока не убьет свою жертву.

## Такса
![Такса][3]
Еще один представитель охотничьих пород – [такса][4]. Эти милые «сардельки на коротких ножках» известны каждому. Таксы были выведены для норной охоты, поэтому их содержание в квартирах подразумевает сдерживание природных инстинктов.

>Внимание! Отвлечь животное от природного желания охотиться могут регулярные тренировки 
>и дрессура. Не забрасывайте уроки по общению с окружающими «на потом»! Чем раньше вы 
>научите пса нормальному общению, тем лучше будет результат.

### См. также:
* [Классификация пород собак][5]
* [Сигналы примирения][6]
* [Кинологические термины][7]
[1]: http://pet-mir.ru/wp-content/uploads/2017/11/Питбуль-700x467.jpg
[2]: https://ru.wikipedia.org/wiki/Американский_питбультерьер
[3]: http://pet-mir.ru/wp-content/uploads/2017/11/Такса-700x366.jpg
[4]: https://ru.wikipedia.org/wiki/Такса
[5]: https://ru.wikipedia.org/wiki/Классификация_пород_собак
[6]: https://ru.wikipedia.org/wiki/Сигналы_примирения
[7]: https://ru.wikipedia.org/wiki/Кинологические_термины`
		},
		{
			id: 2,
			title: 'Формирование альтернатив структуры АСУ ТП',
			content: `
# Формирование альтернатив структуры АСУ ТП

Для формирования концепции конфигурации структуры технического обеспечения системы управления данного технологического процесса первоначально необходимо рассмотреть возможные виды конфигураций этих структур.

## Виды структур

В сфере промышленного производства с позиций управления можно выделить следующие основные классы структур систем управления: децентрализованную, централизованную, централизованную рассредоточенную и иерархическую

## Формирование альтернатив иерархических структур АСУ ТП

__Постановка задачи__

При определении множеств возможных вершин Xо исходного графа G0, предлагается использовать иерархию элементов ТП  и их средств автоматизации. 

### Формирование исходного графа

В соответствии с ГОСТ 3.1109-82 в ТП выделяют следующую иерархию элементов: _действия_ –  _операции_ –  _технологический процесс_ . Если при выполнении части операций изменяется качественное состояние объекта  приложения операций, то выделяют стадии (фазы) технологического процесса[6]. Тогда в общем случае иерархия элементов ТП примет вид: _действия_ –  _операции_  –  _стадии_ – _технологический процесс_. Заметим, что оборудование может реализовывать несколько действий или операций и даже стадий.`
		},
		{
			id: 3,
			title: 'История шахмат',
			content: 
`История шахмат насчитывает около полутора тысяч лет. Вероятно, старейшим известным предком шахмат является индийская игра чатуранга, заимствованная персами, которые видоизменили её и назвали шатрандж. После арабского завоевания Персии в VII веке шатрандж распространился в пределах арабского халифата, а от арабов стал известен европейцам. Близкий к современному облик шахматы приобрели в конце XV века, когда ныне существующие ходы получили ферзь и слон, до того — фигуры с ограниченной подвижностью. Игра существенно изменилась, стала более быстрой, преимущество первого хода у белых сделало возможным появление дебютов, в которых белые готовят атаку на ранней стадии партии, и стимулировало развитие дебютной теории.
В середине XIX века возникает система международных соревнований, сначала — в виде матчей между сильнейшими шахматистами разных городов и стран, со второй половины столетия — также и в виде международных турниров (конгрессов). В 1886 году Вильгельм Стейниц победил Иоганна Цукерторта в матче, став первым чемпионом мира по шахматам. В 1924 году была основана Международная шахматная федерация (ФИДЕ). После смерти четвёртого чемпиона мира Александра Алехина в 1946 году следующие обладатели титула определялись по правилам, утверждённым ФИДЕ. В конце XX века в шахматах произошёл раскол: чемпион мира Гарри Каспаров и претендент Найджел Шорт провели очередной матч не под эгидой ФИДЕ, и в 1993—2006 годах одновременно разыгрывались звания чемпиона мира по версии ФИДЕ и по «классической» версии. С 2006 года розыгрыш звания чемпиона мира унифицирован, и с 2013 года им владеет норвежец Магнус Карлсен.`
		},
		{
			id: 4,
			title: 'Ганимед',
			content: 
`Ганимед (др.-греч. Γανυμήδης, «веселого духа», «радующий душу», «наслаждаться умом/мыслью», лат. Ganymedes, Catamitus) — согласно греческой мифологии прекрасный юноша, сын троянского царя Троса. Из-за своей красоты он был похищен зевсовым орлом на Олимп, где сделался виночерпием на пирах богов и возлюбленным Зевса. Ему также были дарованы бессмертие и вечная молодость.
Миф о Ганимеде стал одним из самых популярных сюжетов в искусстве Древней Греции и Рима. Его символическое содержание имело несколько составляющих: оборотничество Зевса (в орла), однополые отношения и метаморфоза самого Ганимеда (превращение человека в бессмертного). В Средние века Ганимед считался олицетворением порока. В эпоху Возрождения греческий миф вновь обрёл популярность. Художники Ренессанса создали многочисленные произведения, изображающие похищение Ганимеда. При этом гуманисты Возрождения переработали миф в христианскую и неоплатоническую аллегорию стремления человеческой души к богу и абсолюту. Однако Ганимед продолжал восприниматься и как символ однополой любви. Позднее образ греческого юноши использовали в своих произведениях художники барокко и классицизма, а также последующих направлений искусства.`
		},
		{
			id: 5,
			title: 'Markdown',
			content:
`Материал из Википедии — свободной энциклопедии

__Markdown__ (произносится _маркда́ун_) — облегчённый язык разметки, созданный с целью написания наиболее читаемого и удобного для правки текста, но пригодного для преобразования в языки для продвинутых публикаций (HTML, Rich Text и других).


### История
---
Первоначально создан в 2004 году <span style="color:red">Джоном Грубером</span> (англ. [John Gruber](https://en.wikipedia.org/wiki/John_Gruber)) и [Аароном Шварцем](https://ru.wikipedia.org/wiki/Шварц,_Аарон). Многие идеи языка были позаимствованы из существующих соглашений по разметке текста в электронных письмах. Реализации языка Markdown преобразуют текст в формате Markdown в валидный, правильно построенный XHTML и заменяют левые угловые скобки («<») и амперсанды («&») на соответствующие коды сущностей. Первой реализацией Markdown стала написанная Грубером реализация на Perl, однако спустя некоторое время появилось множество реализаций от сторонних разработчиков (см. ниже). Реализация на Perl распространяется по лицензии типа BSD. Реализации Markdown на различных языках программирования включены (или доступны в качестве плагина) во многие системы управления содержимым.

### Примеры синтаксиса
---
Ниже приведены примеры использования Markdown, однако это далеко не полное руководство. Полное описание языка может быть найдено на официальном сайте[6]. Символы, которые обычно рассматриваются в Markdown как специальные, могут быть экранированы с помощью обратного слеша. Например, последовательность «*» выведет символ «*», а не будет являться признаком начала выделенного текста. Кроме того, Markdown не преобразует текст внутри «сырых» блоков XHTML. Таким образом, в Markdown-документ можно включать секции XHTML, заключив их предварительно в теги уровня блока.
* Текст с выделением или логическим ударением:

    <span style="display: block;background-color:#F8F9FA; padding:10px; border: 1px solid #EAECF0;">\`_выделение_\` (например, курсив)<br>
  \`__сильное выделение__\` (например, полужирное начертание)
</span>

 _выделение_ (например, курсив)

 __сильное выделение__ (например, полужирное начертание)

* Программный код:

 <span style="display: block; background-color:#F8F9FA; padding:10px; border: 1px solid #EAECF0;">Код внутри строки (inline) &#8219;Hello world!&#8219;</span>

    Код внутри строки (inline) \`Hello world!\`

* Зачёркнутый текст:

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">необходимо сделать \`~~одну~~\` другую вещь</span>

    необходимо сделать ~~одну~~ другую вещь

* Списки:

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;"> \`* элемент маркированного списка\`<br>
 \`- ещё один элемент ненумерованного списка\`<br>
 \`+ буллеты элементов могут быть разными\`</span>

 * элемент маркированного списка
 - ещё один элемент ненумерованного списка
 + буллеты элементов могут быть разными

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">\`1. Элемент нумерованного списка\`<br>
 \`2. Элемент №2 того же списка\`<br>
 \`9. Элемент №3 списка — элементы нумеруются по порядку, цифра в начале строки не имеет значения\`</span>

 1. Элемент нумерованного списка
 2. Элемент №2 того же списка
 9. Элемент №3 списка — элементы нумеруются по порядку, цифра в начале строки не имеет значения

* Заголовки:

 Создание заголовков производится путём помещения знака решетки перед текстом заголовка. Количество знаков «#» соответствует уровню заголовка. HTML предоставляет 6 уровней заголовков.

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">\`# Заголовок первого уровня\`<br>
\`#### Заголовок четвёртого уровня\`</span>
# Заголовок первого уровня
#### Заголовок четвёртого уровня

 Первые два уровня заголовка также имеют альтернативный синтаксис:

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">Заголовок первого уровня<br>
\`========================\`<br>
Заголовок второго уровня<br>
\`------------------------\`</span>

* Цитаты (тег blockquote):

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">\`> Данный текст будет заключен в HTML-теги <blockquote></blockquote>\`</span>

* Ссылки:

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">\`[Текст ссылки](адрес://ссылки.здесь "Заголовок ссылки")\`</span>

 или

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">\`[Текст ссылки][тег]\`</span>

 и где-нибудь в документе (например в самом низу)

 <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">\`[тег]: адрес://ссылки.здесь "Заголовок ссылки"\`</span>

* Изображения:

  <span style="display: block; background-color:#F8F9FA; padding:10px;  border: 1px solid #EAECF0;">\`![Alt-текст](адрес://ссылки.здесь "Заголовок изображения")\`</span>`
		},
		{
			id: 6,
			title: 'Kakoj нибудь заголовок!',
			content: 'Kakoj нибудь контент!'
		},
		{
			id: 7,
			title: 'Kakoj нибудь заголовок!',
			content: `## Заголовок статьи

Далеко-далеко за[ словесными горами в стране](#), гласных и согласных живут рыбные тексты. Использовало однажды гор семь, снова раз. Города большой безорфографичный меня.

Lorem имени, продолжил своего реторический своих послушавшись грустный даль страну парадигматическая океана рыбными, рыбного переписывается, страна? Свой заголовок свое, он.

## Заголовок второго уровня

Что, повстречался последний всеми его щеке не, знаках встретил использовало, прямо, раз свой. Города силуэт, заглавных всеми, свою прямо но!
екстов которой вскоре журчит рекламных свою, сбить на берегу рот. Великий страну проектах знаках над что путь языком, подпоясал, свой они!

### Заголовок третьего уровня

Cкатился переулка первую единственное имени над запятых, грустный заголовок переписывается власти переписали. 

Букв строчка вскоре продолжил, страна злых раз страну.`
			}
		]

		if (!localStorage.getItem('articles')) {
			localStorage.setItem('articles', JSON.stringify(articles))
		}	
})();
